spec/support/vcr_cassettes/preneeds/burial_forms/creates_a_pre_need_burial_form.yml

---
http_interactions:
- request:
    method: post
    uri: "<PRENEEDS_HOST>/eoas_SOA/PreNeedApplicationPort"
    body:
      encoding: UTF-8
      string: <?xml version="1.0" encoding="UTF-8"?><env:Envelope xmlns:xsd="http://www.w3.org/2001/XMLSchema"
        xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:tns="http://service.soa.eoas.cem.va.gov/"
        xmlns:env="http://schemas.xmlsoap.org/soap/envelope/"><env:Body><tns:receivePreNeedApplication><preNeedRequest><applicant><applicantEmail>hg@hotmail.com</applicantEmail><applicantPhoneNumber>555-555-5555
        - 234</applicantPhoneNumber><applicantRelationshipToClaimant>Self</applicantRelationshipToClaimant><completingReason>I
        don&#39;t know</completingReason><mailingAddress><address1>street 7</address1><address2>street2
        7</address2><city>NY</city><countryCode>USA</countryCode><postalZip>10000</postalZip><state>NY</state></mailingAddress><name><firstName>first
        13</firstName><lastName>last 13</lastName><maidenName>maiden 13</maidenName><middleName>middle
        13</middleName><suffix>Jr.</suffix></name></applicant><applicationStatus>somewhere</applicationStatus><claimant><address><address1>street
        8</address1><address2>street2 8</address2><city>NY</city><countryCode>USA</countryCode><postalZip>10000</postalZip><state>NY</state></address><dateOfBirth>2001-01-31</dateOfBirth><desiredCemetery>400</desiredCemetery><email>a@b.com</email><name><firstName>first
        14</firstName><lastName>last 14</lastName><maidenName>maiden 14</maidenName><middleName>middle
        14</middleName><suffix>Jr.</suffix></name><phoneNumber>1234567890</phoneNumber><relationshipToVet>1</relationshipToVet><ssn>123-45-6789</ssn></claimant><currentlyBuriedPersons><cemeteryNumber>400</cemeteryNumber><name><firstName>first
        15</firstName><lastName>last 15</lastName><maidenName>maiden 15</maidenName><middleName>middle
        15</middleName><suffix>Jr.</suffix></name></currentlyBuriedPersons><currentlyBuriedPersons><cemeteryNumber>400</cemeteryNumber><name><firstName>first
        16</firstName><lastName>last 16</lastName><maidenName>maiden 16</maidenName><middleName>middle
        16</middleName><suffix>Jr.</suffix></name></currentlyBuriedPersons><hasAttachments>false</hasAttachments><hasCurrentlyBuried>1</hasCurrentlyBuried><sendingApplication>vets.gov</sendingApplication><sendingCode>abc</sendingCode><sentTime>2017-11-02T14:29:57Z</sentTime><trackingNumber>J6XiSSKp9isJAY5DQEVG</trackingNumber><veteran><address><address1>street
        9</address1><address2>street2 9</address2><city>NY</city><countryCode>USA</countryCode><postalZip>10000</postalZip><state>NY</state></address><currentName><firstName>first
        17</firstName><lastName>last 17</lastName><maidenName>maiden 17</maidenName><middleName>middle
        17</middleName><suffix>Jr.</suffix></currentName><dateOfBirth>2001-01-31</dateOfBirth><dateOfDeath>2001-01-31</dateOfDeath><gender>Male</gender><isDeceased>unsure</isDeceased><maritalStatus>Married</maritalStatus><militaryServiceNumber>123456789</militaryServiceNumber><placeOfBirth>Brooklyn,
        NY</placeOfBirth><serviceName><firstName>first 18</firstName><lastName>last
        18</lastName><maidenName>maiden 18</maidenName><middleName>middle 18</middleName><suffix>Jr.</suffix></serviceName><serviceRecords><branchOfService>AF</branchOfService><dischargeType>1</dischargeType><enteredOnDutyDate>1940-08-07</enteredOnDutyDate><highestRank>GEN</highestRank><nationalGuardState>N</nationalGuardState><releaseFromDutyDate>1945-08-07</releaseFromDutyDate></serviceRecords><ssn>123-45-6789</ssn><vaClaimNumber>C23456789</vaClaimNumber><militaryStatus>A</militaryStatus></veteran></preNeedRequest></tns:receivePreNeedApplication></env:Body></env:Envelope>
    headers:
      Accept:
      - text/xml;charset=UTF-8
      Content-Type:
      - text/xml;charset=UTF-8
      User-Agent:
      - Vets.gov Agent
      Date:
      - Thu, 02 Nov 2017 14:29:57 GMT
      Content-Length:
      - '3488'
      Accept-Encoding:
      - gzip;q=1.0,deflate;q=0.6,identity;q=0.3
  response:
    status:
      code: 200
      message: OK
    headers:
      Date:
      - Thu, 02 Nov 2017 14:29:57 GMT
      Transfer-Encoding:
      - chunked
      Content-Type:
      - text/xml; charset=utf-8
    body:
      encoding: UTF-8
      string: <?xml version='1.0' encoding='UTF-8'?><S:Envelope xmlns:S="http://schemas.xmlsoap.org/soap/envelope/"><S:Body><ns2:receivePreNeedApplicationResponse
        xmlns:ns2="http://service.soa.eoas.cem.va.gov/"><return><applicationUUID>92082019-a2b4-489a-9b48-a3ebc55b971e</applicationUUID><returnCode>0</returnCode><returnDescription>PreNeed
        Application Received Successfully.</returnDescription></return></ns2:receivePreNeedApplicationResponse></S:Body></S:Envelope>
    http_version: 
  recorded_at: Thu, 02 Nov 2017 14:29:59 GMT
recorded_with: VCR 3.0.3
